MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamha0e/thirdparty/atsamha0e/component/tcc.h
#define TCC_WAVEB_CICCENB_Pos                 _U_(8)                                               /**< (TCC_WAVEB Position) Circular Channel x Enable Buffer */
#define TCC_WAVEB_CICCENB_Msk                 (_U_(0xF) << TCC_WAVEB_CICCENB_Pos)                  /**< (TCC_WAVEB Mask) CICCENB */
#define TCC_WAVEB_CICCENB(value)              (TCC_WAVEB_CICCENB_Msk & ((value) << TCC_WAVEB_CICCENB_Pos)) 
#define TCC_WAVEB_POLB_Pos                    _U_(16)                                              /**< (TCC_WAVEB Position) Channel x Polarity Buffer */
#define TCC_WAVEB_POLB_Msk                    (_U_(0xF) << TCC_WAVEB_POLB_Pos)                     /**< (TCC_WAVEB Mask) POLB */
#define TCC_WAVEB_POLB(value)                 (TCC_WAVEB_POLB_Msk & ((value) << TCC_WAVEB_POLB_Pos)) 
#define TCC_WAVEB_SWAPB_Pos                   _U_(24)                                              /**< (TCC_WAVEB Position) Swap DTI Output Pair 3 Buffer */
#define TCC_WAVEB_SWAPB_Msk                   (_U_(0xF) << TCC_WAVEB_SWAPB_Pos)                    /**< (TCC_WAVEB Mask) SWAPB */
#define TCC_WAVEB_SWAPB(value)                (TCC_WAVEB_SWAPB_Msk & ((value) << TCC_WAVEB_SWAPB_Pos)) 

/* -------- TCC_PERB : (TCC Offset: 0x6C) (R/W 32) Period Buffer -------- */
#define TCC_PERB_RESETVALUE                   _U_(0xFFFFFFFF)                                      /**<  (TCC_PERB) Period Buffer  Reset Value */

#define TCC_PERB_PERB_Pos                     _U_(0)                                               /**< (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_PERB_Msk                     (_U_(0xFFFFFF) << TCC_PERB_PERB_Pos)                 /**< (TCC_PERB) Period Buffer Value Mask */
#define TCC_PERB_PERB(value)                  (TCC_PERB_PERB_Msk & ((value) << TCC_PERB_PERB_Pos))
#define TCC_PERB_Msk                          _U_(0x00FFFFFF)                                      /**< (TCC_PERB) Register Mask  */

/* DITH4 mode */
#define TCC_PERB_DITH4_DITHERCYB_Pos          _U_(0)                                               /**< (TCC_PERB) Dithering Buffer Cycle Number Position */
#define TCC_PERB_DITH4_DITHERCYB_Msk          (_U_(0xF) << TCC_PERB_DITH4_DITHERCYB_Pos)           /**< (TCC_PERB) Dithering Buffer Cycle Number Mask */
#define TCC_PERB_DITH4_DITHERCYB(value)       (TCC_PERB_DITH4_DITHERCYB_Msk & ((value) << TCC_PERB_DITH4_DITHERCYB_Pos))
#define TCC_PERB_DITH4_PERB_Pos               _U_(4)                                               /**< (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_DITH4_PERB_Msk               (_U_(0xFFFFF) << TCC_PERB_DITH4_PERB_Pos)            /**< (TCC_PERB) Period Buffer Value Mask */
#define TCC_PERB_DITH4_PERB(value)            (TCC_PERB_DITH4_PERB_Msk & ((value) << TCC_PERB_DITH4_PERB_Pos))
#define TCC_PERB_DITH4_Msk                    _U_(0x00FFFFFF)                                       /**< (TCC_PERB_DITH4) Register Mask  */

/* DITH5 mode */
#define TCC_PERB_DITH5_DITHERCYB_Pos          _U_(0)                                               /**< (TCC_PERB) Dithering Buffer Cycle Number Position */
#define TCC_PERB_DITH5_DITHERCYB_Msk          (_U_(0x1F) << TCC_PERB_DITH5_DITHERCYB_Pos)          /**< (TCC_PERB) Dithering Buffer Cycle Number Mask */
#define TCC_PERB_DITH5_DITHERCYB(value)       (TCC_PERB_DITH5_DITHERCYB_Msk & ((value) << TCC_PERB_DITH5_DITHERCYB_Pos))
#define TCC_PERB_DITH5_PERB_Pos               _U_(5)                                               /**< (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_DITH5_PERB_Msk               (_U_(0x7FFFF) << TCC_PERB_DITH5_PERB_Pos)            /**< (TCC_PERB) Period Buffer Value Mask */
#define TCC_PERB_DITH5_PERB(value)            (TCC_PERB_DITH5_PERB_Msk & ((value) << TCC_PERB_DITH5_PERB_Pos))
#define TCC_PERB_DITH5_Msk                    _U_(0x00FFFFFF)                                       /**< (TCC_PERB_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_PERB_DITH6_DITHERCYB_Pos          _U_(0)                                               /**< (TCC_PERB) Dithering Buffer Cycle Number Position */
#define TCC_PERB_DITH6_DITHERCYB_Msk          (_U_(0x3F) << TCC_PERB_DITH6_DITHERCYB_Pos)          /**< (TCC_PERB) Dithering Buffer Cycle Number Mask */
#define TCC_PERB_DITH6_DITHERCYB(value)       (TCC_PERB_DITH6_DITHERCYB_Msk & ((value) << TCC_PERB_DITH6_DITHERCYB_Pos))
#define TCC_PERB_DITH6_PERB_Pos               _U_(6)                                               /**< (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_DITH6_PERB_Msk               (_U_(0x3FFFF) << TCC_PERB_DITH6_PERB_Pos)            /**< (TCC_PERB) Period Buffer Value Mask */
#define TCC_PERB_DITH6_PERB(value)            (TCC_PERB_DITH6_PERB_Msk & ((value) << TCC_PERB_DITH6_PERB_Pos))
#define TCC_PERB_DITH6_Msk                    _U_(0x00FFFFFF)                                       /**< (TCC_PERB_DITH6) Register Mask  */


/* -------- TCC_CCB : (TCC Offset: 0x70) (R/W 32) Compare and Capture Buffer -------- */
#define TCC_CCB_RESETVALUE                    _U_(0x00)                                            /**<  (TCC_CCB) Compare and Capture Buffer  Reset Value */

#define TCC_CCB_CCB_Pos                       _U_(0)                                               /**< (TCC_CCB) Channel Compare/Capture Buffer Value Position */
#define TCC_CCB_CCB_Msk                       (_U_(0xFFFFFF) << TCC_CCB_CCB_Pos)                   /**< (TCC_CCB) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCB_CCB(value)                    (TCC_CCB_CCB_Msk & ((value) << TCC_CCB_CCB_Pos))    
#define TCC_CCB_Msk                           _U_(0x00FFFFFF)                                      /**< (TCC_CCB) Register Mask  */

/* DITH4 mode */
#define TCC_CCB_DITH4_DITHERCYB_Pos           _U_(0)                                               /**< (TCC_CCB) Dithering Buffer Cycle Number Position */
#define TCC_CCB_DITH4_DITHERCYB_Msk           (_U_(0xF) << TCC_CCB_DITH4_DITHERCYB_Pos)            /**< (TCC_CCB) Dithering Buffer Cycle Number Mask */
#define TCC_CCB_DITH4_DITHERCYB(value)        (TCC_CCB_DITH4_DITHERCYB_Msk & ((value) << TCC_CCB_DITH4_DITHERCYB_Pos))
#define TCC_CCB_DITH4_CCB_Pos                 _U_(4)                                               /**< (TCC_CCB) Channel Compare/Capture Buffer Value Position */
#define TCC_CCB_DITH4_CCB_Msk                 (_U_(0xFFFFF) << TCC_CCB_DITH4_CCB_Pos)              /**< (TCC_CCB) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCB_DITH4_CCB(value)              (TCC_CCB_DITH4_CCB_Msk & ((value) << TCC_CCB_DITH4_CCB_Pos))
#define TCC_CCB_DITH4_Msk                     _U_(0x00FFFFFF)                                       /**< (TCC_CCB_DITH4) Register Mask  */

